# === 6 ===

x = input('Введите координаты любой клетки шахматной доски: ')
y = input('Введите координаты другой клетки шахматной доски: ')
difference_x = abs(ord(x[0]) - ord(y[0]))
difference_y = abs(int(x[1]) - int(y[1]))

if difference_x <= 1 and difference_y <= 1:
    print('да')
else: 
    print('нет')

# ВЫВОД В ТЕРМИНАЛЕ:

# Пример 1:
# Введите координаты любой клетки шахматной доски: c2
# Введите координаты другой клетки шахматной доски: d3
# да

# Пример 2:
# Введите координаты любой клетки шахматной доски: f7
# Введите координаты другой клетки шахматной доски: d7
# нет